Предполагается, что в рамках данного задания ученики сами будут изучать документацию, как минимум используя функционал `tab` и `shift+tab` от Jupyter

1. Импортируйте библиотеку pandas 
2. Считайте файл `wage.csv` в DataFrame с названием `wage`. Используйте для этого функцию pd.read_csv()

`person_id` - идентификатор человека

`gender` - пол, 0 - женский, 1 - мужской

`wage` - заработная плата в рублях

In [3]:
import pandas as pd
DataFrame = pd.read_csv("wage.csv")
print(DataFrame)

      person_id  gender           wage
0             0       1   46793.603811
1             1       1   33481.575720
2             2       1   44523.699084
3             3       1   15995.576829
4             4       0   10282.631224
...         ...     ...            ...
1001        995       1   66503.737185
1002        996       1    9972.956272
1003        997       0  104504.616392
1004        998       1   98927.903076
1005        999       1  108107.141368

[1006 rows x 3 columns]

3. Поменяйте колонку `gender` так, чтобы были записи `F` (female) и `M` (male) вместо 0 и 1

In [5]:
def get_gender(gender):
    if gender == 0:
        return "F"
    if gender == 1:
        return "M"


DataFrame['gender'] = DataFrame['gender'].apply(get_gender)
DataFrame

      person_id gender           wage
0             0      M   46793.603811
1             1      M   33481.575720
2             2      M   44523.699084
3             3      M   15995.576829
4             4      F   10282.631224
...         ...    ...            ...
1001        995      M   66503.737185
1002        996      M    9972.956272
1003        997      F  104504.616392
1004        998      M   98927.903076
1005        999      M  108107.141368

[1006 rows x 3 columns]

4. Давайте посчитаем среднюю зарплату у мужчин и женщин. Для этого используйте метод `groupby` со следующим синтаксисом:

`dataframe.groupby(Название_колонки_для_группировки)[Перечисление_колонок_для_агрегации].функция_агрегации()`

In [7]:

DataFrame.groupby('gender')['wage'].mean()

gender
F    40855.747261
M    46815.944005
Name: wage, dtype: float64

5. Теперь взглянем внимательнее на данные и обнаружим, что некоторые люди попали в выборку несколько раз. 
    1. Найдите таких людей. Подсказка: `value_counts()`
    0. Убедитесь, что записи по ним с одинаковым `wage`. Возможно, тут вам пригодится функция агрегации `nunique()`, отображающая количество разных значений
    0. Избавьтесь от повторяющихся значений. Подсказка: `drop_duplicates()`

In [9]:
duplicate_persons = DataFrame['person_id'].value_counts()
duplicate_persons = duplicate_persons[duplicate_persons > 1]
duplicates_check = DataFrame[DataFrame['person_id'].isin(duplicate_persons.index)]
wage_nunique = duplicates_check.groupby('person_id')['wage'].nunique()
df = DataFrame.drop_duplicates(subset=['person_id'])

6. Теперь посмотрим внимательнее на зарплаты
    1. Охарактеризуйте имеющиеся данные по зарплатам. Подсказка: `describe`
    1. Избавьтесь от бессмысленных значений

In [11]:
DataFrame.groupby('gender')['wage'].describe()

,count,mean,std,min,25%,50%,75%,max
gender,,,,,,,,
F,498.0,40855.747261,48073.059382,-34658.114940,14689.986704,26606.365628,46823.314807,436170.404059
M,508.0,46815.944005,62154.821787,-287418.645743,14419.449954,28794.605952,56220.521659,755320.874132

7. Давайте теперь посмотрим на зарплату с учетом бонуса. Для этого нам понадобится таблица `bonus.csv`. Считайте ее в переменную `bonus`. Заметьте, что она сохранена немного в другом формате, и вам понадобится уточнить параметр `sep` - разделитель записей. Сравните текущий файл с предыдущим и попробуйте решить проблему

In [13]:
bonus = pd.read_csv("bonus.csv", sep=';')
bonus

     person_id          bonus
0          905   85059.638382
1          836    7703.346074
2          287    3120.269742
3          548    5347.987142
4          575  137257.490614
..         ...            ...
445        488   28102.252903
446        913   55549.347647
447        616  620397.407705
448        110   14086.067488
449        848   13441.072859

[450 rows x 2 columns]

8. Чтобы посчитать итоговую зарплату, нам нужно по каждому человеку знать и оклад, и премию. Для этого надо будет соединить (сджойнить) таблицы по `person_id`. Используйте для этого функцию `pd.merge`. Помните, что параметр `how` должен быть `'outer'`, чтобы сохранить те записи, что есть только в одной таблице. Результат запишите в новый dataframe `df`

In [15]:
df = pd.merge(DataFrame, bonus, on=['person_id'], how='outer')
df

      person_id gender           wage         bonus
0             0      M   46793.603811  3.332934e+04
1             1      M   33481.575720           NaN
2             2      M   44523.699084  3.192912e+06
3             3      M   15995.576829  2.196858e+04
4             4      F   10282.631224           NaN
...         ...    ...            ...           ...
1005        995      M   66503.737185  3.452137e+03
1006        996      M    9972.956272  3.892790e+05
1007        997      F  104504.616392  5.380978e+04
1008        998      M   98927.903076           NaN
1009        999      M  108107.141368           NaN

[1010 rows x 4 columns]

9. Наконец, давайте посчитаем итоговую зарплату
    1. Замените отсутствующие записи в колонке `bonus` нулями
    1. Уберите людей без `wage` - это те "плохие" записи, от которых мы избавлялись на предыдущих шагах
    1. Сделайте новую колонку `total`, которая будет равна 12 окладам и премии
    1. Посчитайте среднюю и медианную итоговую зарплату в разрезе по полу. Подсказка: вместо функции агрегации можно написать `.agg()` и перечислить внутри нужные агрегаты

In [17]:
df['bonus'] = df['bonus'].fillna(0).astype(float)
df = df.dropna(subset=['wage'])

def get_zp(row):
    return row['wage'] * 12 + row['bonus']

df['total'] = df.apply(get_zp, axis=1)
df.groupby('gender')['total'].agg(['mean','median'])

                 mean         median
gender
F       564598.301505  347311.814999
M       651435.213754  435581.404242